In [4]:
import pandas as pd
s1 = pd.Series([1,2,3,4], ['a','b','c','d'])
s1

a    1
b    2
c    3
d    4
dtype: int64

In [5]:
data = [1,2,3,4,5]
index=['a','b','c','d', 'e']
s2 = pd.Series(data, index)
s2

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [9]:
data2 = { 'Name': ['abc','def','ghi'],
         'Age' : [12,13,14],
          'City': ['a','b','c']}
df = pd.DataFrame(data2)
df

  Name  Age City
0  abc   12    a
1  def   13    b
2  ghi   14    c

In [10]:
df = pd.DataFrame([[1,2,3],[4,5,6]], columns=['X','Y','Z'])
df

   X  Y  Z
0  1  2  3
1  4  5  6

In [15]:
import numpy as np
arr = np.array([[1,2,3],[4,5,6]])
arr
df = pd.DataFrame(arr, columns=['A','B','C'])
df

   A  B  C
0  1  2  3
1  4  5  6